package Chapter7;

public class chap7 {
	
	
	/**第七章：拾遗增补
	 * 
	 * 对前面章节的知识点补充
	 * 
	 * -----------线程的状态----------------
	 * 7_01: 验证NEW,RUNNABLE和TERMINATED状态
	 * 7_02: 验证TIMED_WAITING状态
	 * 7_03: 验证BLOCKED状态
	 * 7_04: 验证WAITING状态
	 * 
	 * -----------线程组----------------
	 * 7_05: 线程对象关联线程组：一级关联
	 * 7_06: 线程对象关联线程组：多级关联
	 * 7_07: 线程组的自动归属特性
	 * 7_08: 获取根线程组
	 * 7_09: 线程组里加线程组
	 * 7_10: 线程组内的线程批量停止
	 * 7_11: 递归与非递归取得组内对象
	 * 
	 * -----------使线程具有有序性----------------
	 * 7_12: 使线程具有有序性
	 * 
	 * -----------SimpleDateFormat非线程安全----------------
	 * 7_13: SimpleDateFormat出现异常的情况
	 * 7_14: 解决异常方法1：创建多个SimpleDateFormat对象
	 * 7_15: 解决异常方法2： 使用ThreadLocal类
	 * 
	 * -----------其他异常处理----------------
	 * 7_16: 线程中出现异常的处理
	 * 7_17: 线程组内处理异常
	 * 7_18: 线程异常处理的传递
	 * 
	 * 
	 */

}
