package Chapter6;

public class chap6 {
	
	/**第六章：单例模式与多线程
	 * 
	 * 6_01: 简介
	 * 
	 * -----------立即加载/饿汉模式----------------
	 * 6_02: 立即加载/饿汉模式
	 * 
	 * -----------延迟加载/懒汉模式----------------
	 * 6_03: 延迟加载/懒汉模式解析
	 * 6_04: 延迟加载/懒汉模式的缺点
	 * 6_05: 延迟加载/懒汉模式的缺点的解决方法1：声明synchronize关键字
	 * 6_06: 延迟加载/懒汉模式的缺点的解决方法2：使用同步代码块
	 * 6_07: 延迟加载/懒汉模式的缺点的解决方法3：部分同步
	 * 6_08: 延迟加载/懒汉模式的缺点的解决方法4：DCL双检查锁机制(Double-Check Locking)
	 * 
	 * -----------使用其他方法实现单例模式----------------
	 * 6_09: 使用静态内置类实现单例模式
	 * 6_10: 序列化与反序列化的单例模式实现
	 * 6_11: 使用static代码实现单例模式
	 * 
	 * -----------用enum枚举类实现单例模式----------------
	 * 6_12: 使用enum枚举数据类型实现单例模式
	 * 6_13: 完善使用enum枚举数据类型实现单例模式
	 * 
	 */

}
